"""
    #Задание числа
a=2
b=0.5
print(a+b)
    #практика:строки
name=input('Введите ваше имя:')
print(f'Привет, {name}! Как дела?')

    #Практика: числа
v=input('Введите число от 0 до 10:')
print(int(v)+10)
"""
    # Практика: приведение типов
print(float('1'))  #1.0
print(int('2.5')) #ValueError: invalid literal for int() with base 10: '2.5'
print(bool(1)) #True
print (bool('')) #False
print (bool('0')) #False


